Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/environment/agriculture_and_forestry/rural_environmental_protection_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Various schemes have been set up over the years to provide income support for farmers who engage in specified environmental activities
ga: Táthar tar éis scéimeanna éagsúla a bhunú le himeacht na mblianta chun tacaíocht ioncaim a sholáthar d’fheirmeoirí a ghlacann rannpháirt i ngníomhaíochtaí comhshaoil sonraithe

source: The current Green, Low-Carbon Agri-Environment Scheme (GLAS), builds on the earlier REPS and AEOS schemes
ga: Cuireann an Scéim Ghlas ar Bheagán Carbóin do Chomhshaol na Talmhaíochta (GLAS) reatha leis na scéimeanna REPS agus AEOS roimhe sin

source: The Green, Low-Carbon Agri-Environment Scheme is part of the Rural Development Programme 2014-2020
ga: Tá an Scéim ar Bheagán Carbóin do Chomhshaol na Talmhaíochta mar chuid den Chlár Forbartha Tuaithe 2014-2020

source: It provides funding to farmers in return for delivering environmental management on their land
ga: Soláthraítear maoiniú léi d’fheirmeoirí ar sheachadadh bainistiú.comhshaoil ar a gcuid talún

source: Farmers must commit to the scheme for a minimum period of 5 years
ga: Caitheann na feirmeoirí gealltanas a thabhairt don scéim ar feadh íostréimhse 5 bliana

source: GLAS has a number of interlinked aims, which include:
ga: Baineann roinnt aidhmeanna idirnasctha le GLAS, lena n-áirítear:

source: • Protecting agricultural land, its habitats and biodiversity
ga: • Talamh na talmhaíochta, a gnáthóga agus a bitheolaíocht a chosaint

source: • Promoting environmentally sustainable methods of farming
ga: • Modhanna inbhuanaithe na feirmeoireachta ó thaobh an chomhshaoil de a chur chun cinn

source: • Addressing issues of climate change mitigation, water quality and the preservation of habitats and species
ga: • Aghaidh a thabhairt ar shaincheisteanna um maolú an athraithe aeráide, um cháilíocht uisce agus um chaomhnú gnáthóg agus speiceas

source: • Maintaining features such as traditional drystone walls and hedgerows
ga: • Gnéithe a chothabháil ar nós ballaí cloiche traidisiúnta agus fálta sceach

source: All farmers in GLAS must comply with a list of mandatory core requirements, which aim to ensure that farmers have an enhanced level of environmental knowledge
ga: Caitheann gach feirmeoir in GLAS cloí le liosta croí-cheangaltas éigeantach, leis an aidhm chun a chinntiú go mbíonn leibhéal feasa comhshaoil feabhsaithe ag na feirmeoirí

source: Farmers must keep records of relevant actions delivered and must also have a plan for nutrient resource efficiency on their holding
ga: Caitheann na feirmeoirí taifid a choinneáil i leith na mbeart ábhartha a sheachadtar agus caitheann plean bheith acu freisin don éifeachtúlacht acmhainní cothaitheach ar a ngabháltas

source: They must also undergo training in environmental practices and standards
ga: Caitheann siad oiliúint a dhéanamh freisin sna cleachtais agus caighdeáin chomhshaoil

source: Access to GLAS is divided into several tiers and sub-tiers
ga: Roinntear an rochtain ar GHLAS ina gcisil agus ina bhfo-chisil ilíocha

source: Tier 1 (a) is the highest priority access to the scheme
ga: Is le Ciseal 1 (a) a bhaineann an rochtain tosaíochta is airde don scéim

source: You can gain access to it if your holding contains Priority Environmental Assets such as private Natura sites, particular farmland birds (for example, corncrakes or hen harriers), commonages, high status water areas or rare breeds
ga: Is féidir leat rochtain a fháil uirthi má fhaightear Sócmhainní Comhshaoil Tosaíochta i do ghabháltas ar nós suíomhanna príobháideacha Natura, éan feirme faoi leith (mar shampla, traonaigh nó cromáin na gcearc), coimíneachtaí, limistéar uisce ardstádais nó pórtha neamhchoitianta

source: If your holding contains any of these, you must choose them and plan the relevant actions
ga: Má fhaightear aon cheann acu siúd ar do ghabháltas, caithfidh tú iad a roghnú agus na bearta ábhartha a phleanáil

source: Tier 1 (b) is for farmers who engage in Priority Environmental Actions, which include minimum tillage; catch crops establishment from a sown crop, low-emission slurry spreading and wild bird cover
ga: Baineann Ciseal 1 (b) le feirmeoirí a dhéanann Bearta Comhshaoil Tosaíochta, lena n-áirítear an íoschuraíocht; bunú idirbharr ó bharr curtha, leathadh sciodair le hastaíochtaí ísle agus bratbharr d’éin fiáine

source: There are detailed requirements as regards stocking rates (for livestock farms) and area (for arable farms)
ga: Baineann ceangaltais mhionsonraithe leo maidir le rátaí stocála (d’fheirmeacha beostoic) agus maidir le hachar (d’fheirmeacha arúla)

source: Registered organic farmers may qualify for priority access to the scheme under Tier 1(b) by selecting actions appropriate to the farm
ga: Féadann feirmeoirí orgánacha cláraithe cáiliú do rochtain tosaíochta ar an scéim faoi Chiseal 1(b) ach bearta a roghnú arb iomchuí don fheirm iad

source: It is not guaranteed that all eligible applicants in Tier 1(b) will get into the Scheme and a scoring matrix will apply if necessary
ga: Ní ráthaítear go bhfaighidh gach iarratasóir incháilithe i gCiseal 1(b) spás sa Scéim, agus beidh feidhm le maitrís scórála más gá

source: Tier 2 is the second level of access to GLAS
ga: Is é Ciseal 2 an dara leibhéal rochtana ar GLAS

source: It is not guaranteed that all eligible applicants in Tier 2 will get into the Scheme and a scoring matrix will apply if necessary
ga: Ní ráthaítear go bhfaighidh gach iarratasóir cáilithe i gCiseal 2 spás sa Scéim agus beidh feidhm le maitrís scórála más gá

source: Tier 2 (a) is for farmers who do not have Priority Environmental Assets but whose lands include a Vulnerable Water Area
ga: Baineann Ciseal 2 (a) le feirmeoirí nach bhfuil Sócmhainní Comhshaoil Tosaíochta acu, ach a n-áirítear Limistéar Uisce i mBaol lena gcuid tailte

source: You must select the appropriate actions relevant to Vulnerable Water Areas
ga: Ní foláir duit na bearta iomchuí a roghnú arb ábhartha do na Limistéir Uisce i mBaol iad

source: Tier 2 (b) is for farmers who do not have a Vulnerable Water Area but who engage in one of the Priority Environmental Actions listed under Tier 1 (b)
ga: Baineann Ciseal 2 (b) d'fheirmeoirí nach bhfuil Limistéar Uisce i mBaol acu, ach a dhéanann ceann de na Bearta Comhshaoil Tosaíochta a liostaítear faoi Chiseal 1 (b)

source: There are different requirements as regards stocking rates and area of holding
ga: Bíonn ceangaltais éagsúla ann maidir le rátaí stocála agus achar an ghabháltais

source: Tier 3 covers a series of general actions, which aim to enhance the environmental, water quality and biodiversity benefits delivered
ga: Cuimsíonn Ciseal 3 sraith beart ginearálta, leis an aidhm chun seachadadh na dtairbhí comhshaoil, cáilíochta uisce agus bithéagsúlachta a fheabhsú

source: They can be chosen in addition to Tier 1 and Tier 2 actions or on their own
ga: Is féidir iad a roghnú i dteannta le bearta Chiseal 1 agus Chiseal 2 nó astu féin

source: However, choosing only general actions will not guarantee entry to the scheme
ga: Ní ráthófar rochtain isteach sa scéim le roghnú beart ginearálta amháin ámh

source: These actions include bat boxes, coppicing hedgerows, low-input permanent pasture and protection of archaeological sites
ga: Áirítear leis na bearta sin boscaí d’ialtóga, barrscoitheadh fálta sceach, féarach buan ionchuir ísil agus cosaint na suíomhanna seandálaíochta

source: A scoring matrix will be used to allow farmers to join GLAS by means of these actions if take-up of Tier 1 and Tier 2 actions permits
ga: Bainfear leas as maitrís scórála chun ligean d'fheirmeoirí chun ballraíocht a ghlacadh le GLAS trí mheán na mbeart úd má cheadaítear amhlaidh leis an nglacadh le bearta Chiseal 2 agus Chiseal 2

source: Some farmers undertaking particularly challenging actions may qualify for GLAS+, a mechanism to provide additional compensation in return for exceptional environmental commitment
ga: Féadann roinnt feirmeoirí a gheallann chun bearta rí-dhúshlánacha a dhéanamh bheith incháilithe do GLAS+, ar meicníocht í chun cúiteamh breise a sholáthar ar thiomantas eisceachtúil don chomhshaol

source: GLAS+ will typically apply where the Priority Environmental Assets on the farm require the farmer to deliver a particularly high level of environmental commitment
ga: Is iondúil go mbeidh feidhm le GLAS+ mar a dteastaíonn ó na Sócmhainní Comhshaoil Tosaíochta ar an bhfeirm go seachadfaidh an feirmeoir leibhéal an-ard de thiomantas comhshaoil

source: Detailed rates of payment for the various elements of GLAS are on the website of the Department of Agriculture, Food and the Marine
ga: Tá rátaí mionsonraithe íocaíochta do na gnéithe éagsúla den GLAS ar fáil ar láithreán gréasáin na Roinne Talmhaíochta, Bia agus Mara

source: In general, the maximum GLAS payment is €5,000 per year
ga: Is iondúil gurb ionann an íosíocaíocht GLAS agus €5,000 in aghaidh na bliana

source: However, some farmers undertaking particularly challenging actions may qualify for GLAS+ and for a top-up payment of up to €2,000 per year
ga: Féadann roinnt feirmeoirí a thugann faoi bhearta fíordhúshlánacha cáiliú do GLAS+ agus d’íocaíocht breise suas le €2,000 in aghaidh na bliana

source: In the case of Registered Farm Partnerships, these maximum amounts may be multiplied by the number of farm holdings brought to the Partnership, subject to a maximum of 3 holdings
ga: I gcás Comhpháirtíochtaí Feirme Cláraithe, is féidir na huasmhéideanna sin a iolrú faoi líon na ngabháltas feirme a thugtar chun na Comhpháirtíochta, faoi réir uaslíon 3 ghabháltas

source: An approved GLAS advisor must prepare the GLAS application
ga: Caitheann comhairleoir faofa GLAS an t-iarratas GLAS a ullmhú

source: For further information, you can contact your local office of the Department of Agriculture, Food and the Marine or Teagasc
ga: I gcomhair a thuilleadh eolais, déan teagmháil le d’oifig áitiúil den Roinn Talmhaíochta, Bia agus Mara nó le Teagasc
